# System Zone Element Type Humidification Set Point Property

Source: https://www.revitapidocs.com/2026/06411fd9-3f21-65d7-5ab0-d92b105330d4.htm

---

| System Zone Element Type Humidification Set Point Property |
| --- |

The humidification set point as a number between 0 and 1\.
**Namespace:** Autodesk.Revit.DB.Mechanical
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public double HumidificationSetPoint { get; set; }
```

```
Public Property HumidificationSetPoint As Double
	Get
	Set
```

```
public:
property double HumidificationSetPoint {
	double get ();
	void set (double value);
}
```

```
member HumidificationSetPoint : float with get, set
```

#### Property Value

Double Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentException | When setting this property: |

See Also

#### Reference

SystemZoneElementType Class Autodesk.Revit.DB.Mechanical Namespace